{
  "courses": [
    {
      "id": 1,
      "code": "EEEN 101",
      "name": "Introduction to Electrical & Electronics Engineering",
      "description": "The purpose of this course is to provide a solid introduction to the freshmen of the fundamental principles of Electrical-Electronic Engineering. It lays the foundations of topics and techniques which will be covered in the four years of their Electrical-Electronic Engineering education.",
      "keywords": "circuit analysis, Ohm's law, Kirchhoff's laws, capacitors, inductors, AC circuits, phasors, power, digital systems, binary, logic gates, signals, engineering ethics",
      "content": [
        {"week_number": 1, "topic": "Introduction to Electrical Engineering - History, career paths, engineering design process"},
        {"week_number": 2, "topic": "Fundamental Quantities - Charge, current, voltage, power, and energy"},
        {"week_number": 3, "topic": "Circuit Elements - Resistors, voltage and current sources, switches"},
        {"week_number": 4, "topic": "Ohm's Law and Kirchhoff's Laws - Series and parallel circuits"},
        {"week_number": 5, "topic": "Circuit Analysis Techniques - Node voltage and mesh current methods"},
        {"week_number": 6, "topic": "Thevenin and Norton Equivalents - Source transformation"},
        {"week_number": 7, "topic": "Capacitors and Inductors - Energy storage elements, RC and RL circuits"},
        {"week_number": 8, "topic": "First-Order Circuits - Natural and step response"},
        {"week_number": 9, "topic": "Second-Order Circuits - RLC circuits, damping"},
        {"week_number": 10, "topic": "AC Circuit Analysis - Phasors and impedance"},
        {"week_number": 11, "topic": "AC Power - Average power, RMS values, power factor"},
        {"week_number": 12, "topic": "Introduction to Digital Systems - Binary numbers, logic gates"},
        {"week_number": 13, "topic": "Signals and Systems Overview - Time and frequency domain"},
        {"week_number": 14, "topic": "Engineering Ethics and Professionalism - Review and future courses"}
      ]
    },
    {
      "id": 2,
      "code": "EEEN 201",
      "name": "Analog Electronics I",
      "description": "This course provides the students with an exposure to essential elements of analog electronics. The course concentrates on the introductory material associated with analog electronics and introduces students to fundamental electronic devices such as diodes, transistors and operational amplifiers. It develops on the notion of DC and small signal behavior. Students are shown how these devices are used in amplifier and switching circuits.",
      "keywords": "semiconductors, diodes, BJT, MOSFET, amplifiers, biasing, small signal analysis, frequency response, operational amplifiers, transistor models",
      "content": [
        {"week_number": 1, "topic": "Review of Circuit Analysis - Voltage dividers, current dividers, Thevenin equivalent"},
        {"week_number": 2, "topic": "Semiconductor Physics - PN junction, energy bands, carrier drift and diffusion"},
        {"week_number": 3, "topic": "Diode Characteristics - I-V characteristics, diode models, temperature effects"},
        {"week_number": 4, "topic": "Diode Applications - Rectifier circuits, clipping and clamping circuits"},
        {"week_number": 5, "topic": "Bipolar Junction Transistors (BJT) - Structure, operation modes, I-V characteristics"},
        {"week_number": 6, "topic": "BJT Biasing - DC analysis, bias point selection, bias stability"},
        {"week_number": 7, "topic": "Small Signal Analysis - Hybrid-pi model, voltage and current gain"},
        {"week_number": 8, "topic": "BJT Amplifier Configurations - Common emitter, common base, common collector"},
        {"week_number": 9, "topic": "MOSFET Fundamentals - Structure, operation, enhancement and depletion modes"},
        {"week_number": 10, "topic": "MOSFET Biasing and Small Signal Analysis - DC operating point, small signal model"},
        {"week_number": 11, "topic": "MOSFET Amplifiers - Common source, common gate, common drain configurations"},
        {"week_number": 12, "topic": "Frequency Response - Bode plots, Miller effect, high-frequency models"},
        {"week_number": 13, "topic": "Multi-Stage Amplifiers - Cascading, interstage coupling, overall gain"},
        {"week_number": 14, "topic": "Introduction to Operational Amplifiers - Ideal op-amp, inverting and non-inverting amplifiers"}
      ]
    },
    {
      "id": 3,
      "code": "EEEN 202",
      "name": "Analog Electronics II",
      "description": "With this second course in Electronics students are shown how the electronic components and devices of the first course are further used in filter, amplifier and wave shaping circuits. Advanced topics in analog circuit design including differential amplifiers, feedback, and active filters.",
      "keywords": "active filters, differential amplifiers, current mirrors, feedback, oscillators, waveform generators, voltage regulators, ADC, DAC, analog IC design",
      "content": [
        {"week_number": 1, "topic": "Operational Amplifier Applications - Summing amplifier, difference amplifier, instrumentation amplifier"},
        {"week_number": 2, "topic": "Active Filters I - First-order low-pass and high-pass filters"},
        {"week_number": 3, "topic": "Active Filters II - Second-order filters, Butterworth and Chebyshev responses"},
        {"week_number": 4, "topic": "Differential Amplifiers - Differential pairs, common-mode rejection ratio"},
        {"week_number": 5, "topic": "Current Mirrors and Active Loads - Basic and cascode current mirrors"},
        {"week_number": 6, "topic": "Output Stages - Class A, B, and AB amplifiers, push-pull configuration"},
        {"week_number": 7, "topic": "Feedback Amplifiers - Negative feedback, types of feedback topologies"},
        {"week_number": 8, "topic": "Stability and Compensation - Phase margin, gain margin, frequency compensation"},
        {"week_number": 9, "topic": "Oscillators - Barkhausen criterion, Wien bridge, phase-shift oscillators"},
        {"week_number": 10, "topic": "Waveform Generators - Multivibrators, 555 timer, function generators"},
        {"week_number": 11, "topic": "Voltage Regulators - Linear regulators, switching regulators, voltage references"},
        {"week_number": 12, "topic": "Data Converters - Digital-to-analog converters (DAC), analog-to-digital converters (ADC)"},
        {"week_number": 13, "topic": "Analog Integrated Circuits - IC design considerations, analog layout basics"},
        {"week_number": 14, "topic": "Advanced Topics and Review - Mixed-signal circuits, noise analysis"}
      ]
    },
    {
      "id": 4,
      "code": "EEEN 203",
      "name": "Circuits and Systems I",
      "description": "This course is addressed to the engineering sophomores who have successfully completed Electrical & Electronics Circuits I. The course provides the students with an exposure to essential principles and practices of fundamental electrical and electronic circuits.",
      "keywords": "AC power, three-phase circuits, transformers, frequency response, two-port networks, Laplace transform, transfer functions, Fourier series, Fourier transform",
      "content": [
        {"week_number": 1, "topic": "Review of Circuit Analysis - Mesh and nodal analysis, superposition"},
        {"week_number": 2, "topic": "Network Theorems - Thevenin, Norton, maximum power transfer"},
        {"week_number": 3, "topic": "Sinusoidal Steady-State Analysis - Phasors, impedance, admittance"},
        {"week_number": 4, "topic": "AC Power Analysis - Instantaneous, average, and reactive power"},
        {"week_number": 5, "topic": "Three-Phase Circuits - Wye and delta connections, balanced systems"},
        {"week_number": 6, "topic": "Magnetically Coupled Circuits - Mutual inductance, transformers, ideal transformers"},
        {"week_number": 7, "topic": "Frequency Response - Transfer functions, resonance, bandwidth"},
        {"week_number": 8, "topic": "Two-Port Networks - Parameters (Z, Y, h, ABCD), interconnections"},
        {"week_number": 9, "topic": "Laplace Transform I - Definition, properties, inverse transform"},
        {"week_number": 10, "topic": "Laplace Transform II - Circuit analysis using Laplace transform"},
        {"week_number": 11, "topic": "Transfer Functions - Poles and zeros, frequency response from transfer function"},
        {"week_number": 12, "topic": "Fourier Series - Periodic signals, trigonometric and exponential Fourier series"},
        {"week_number": 13, "topic": "Fourier Transform - Continuous-time Fourier transform, properties"},
        {"week_number": 14, "topic": "Applications and Review - Filtering, spectral analysis"}
      ]
    },
    {
      "id": 5,
      "code": "EEEN 204",
      "name": "Circuits and Systems II",
      "description": "Advanced circuit analysis and systems theory. This course addresses the properties of continuous and discrete-time signals and systems, the analysis of signals and systems in the time and frequency domains, convolution, Fourier Series, and Fourier Transform.",
      "keywords": "LTI systems, convolution, DTFT, z-transform, DFT, FFT, digital filters, sampling theorem, state-space analysis, discrete-time signals",
      "content": [
        {"week_number": 1, "topic": "Signals and Systems Overview - Classification of signals, system properties"},
        {"week_number": 2, "topic": "Linear Time-Invariant Systems - Impulse response, convolution integral"},
        {"week_number": 3, "topic": "Convolution - Graphical convolution, properties of convolution"},
        {"week_number": 4, "topic": "Fourier Series Representation - Convergence, Parseval's theorem"},
        {"week_number": 5, "topic": "Fourier Transform Properties - Linearity, time-shifting, frequency-shifting"},
        {"week_number": 6, "topic": "Filtering and Modulation - Ideal filters, amplitude modulation"},
        {"week_number": 7, "topic": "Sampling Theorem - Nyquist rate, aliasing, reconstruction"},
        {"week_number": 8, "topic": "Discrete-Time Signals - Sequences, discrete-time systems"},
        {"week_number": 9, "topic": "Discrete-Time Fourier Transform - DTFT properties, frequency response"},
        {"week_number": 10, "topic": "Z-Transform - Definition, properties, region of convergence"},
        {"week_number": 11, "topic": "Z-Transform Applications - Transfer functions, system analysis"},
        {"week_number": 12, "topic": "Discrete Fourier Transform - DFT, FFT algorithm"},
        {"week_number": 13, "topic": "Digital Filter Design - FIR and IIR filters"},
        {"week_number": 14, "topic": "State-Space Analysis - State variables, state equations"}
      ]
    },
    {
      "id": 6,
      "code": "EEEN 214",
      "name": "Digital Logic Design",
      "description": "Introduction to digital logic and computer hardware design. Topics include number systems, Boolean algebra, combinational and sequential logic circuits, and basic computer architecture.",
      "keywords": "Boolean algebra, logic gates, combinational logic, Karnaugh maps, sequential logic, flip-flops, counters, finite state machines, VHDL, Verilog",
      "content": [
        {"week_number": 1, "topic": "Number Systems - Binary, octal, hexadecimal, conversions"},
        {"week_number": 2, "topic": "Binary Arithmetic - Addition, subtraction, 2's complement"},
        {"week_number": 3, "topic": "Boolean Algebra - Laws, theorems, DeMorgan's theorem"},
        {"week_number": 4, "topic": "Logic Gates - AND, OR, NOT, NAND, NOR, XOR gates"},
        {"week_number": 5, "topic": "Combinational Logic I - Sum of products, product of sums"},
        {"week_number": 6, "topic": "Karnaugh Maps - Simplification techniques, don't care conditions"},
        {"week_number": 7, "topic": "Combinational Logic II - Multiplexers, demultiplexers, decoders, encoders"},
        {"week_number": 8, "topic": "Arithmetic Circuits - Half adder, full adder, parallel adder, comparators"},
        {"week_number": 9, "topic": "Sequential Logic Fundamentals - Latches and flip-flops"},
        {"week_number": 10, "topic": "Registers and Counters - Shift registers, synchronous and asynchronous counters"},
        {"week_number": 11, "topic": "Finite State Machines - Moore and Mealy machines, state diagrams"},
        {"week_number": 12, "topic": "Memory Devices - RAM, ROM, programmable logic devices"},
        {"week_number": 13, "topic": "Hardware Description Languages - Introduction to VHDL or Verilog"},
        {"week_number": 14, "topic": "Digital System Design - Design methodology, testing"}
      ]
    },
    {
      "id": 7,
      "code": "EEEN 301",
      "name": "Electromagnetic Fields and Waves",
      "description": "Introduction to electromagnetic theory including electrostatics, magnetostatics, Maxwell's equations, and electromagnetic wave propagation. Applications to transmission lines and antennas.",
      "keywords": "Maxwell's equations, electromagnetic waves, electrostatics, magnetostatics, Gauss's law, Faraday's law, wave propagation, transmission lines, Smith chart, antennas",
      "content": [
        {"week_number": 1, "topic": "Vector Analysis - Coordinate systems, gradient, divergence, curl"},
        {"week_number": 2, "topic": "Electrostatics I - Coulomb's law, electric field intensity"},
        {"week_number": 3, "topic": "Electrostatics II - Gauss's law, electric potential"},
        {"week_number": 4, "topic": "Conductors and Dielectrics - Boundary conditions, capacitance"},
        {"week_number": 5, "topic": "Poisson's and Laplace's Equations - Solution methods"},
        {"week_number": 6, "topic": "Magnetostatics I - Biot-Savart law, Ampere's law"},
        {"week_number": 7, "topic": "Magnetostatics II - Magnetic flux density, magnetic materials"},
        {"week_number": 8, "topic": "Time-Varying Fields - Faraday's law, induced EMF, transformers"},
        {"week_number": 9, "topic": "Maxwell's Equations - Integral and differential forms, displacement current"},
        {"week_number": 10, "topic": "Electromagnetic Wave Propagation - Wave equation, plane waves"},
        {"week_number": 11, "topic": "Wave Reflection and Transmission - Boundary conditions, standing waves"},
        {"week_number": 12, "topic": "Transmission Lines - Distributed parameters, characteristic impedance"},
        {"week_number": 13, "topic": "Smith Chart and Impedance Matching - Reflection coefficient, VSWR"},
        {"week_number": 14, "topic": "Antennas and Radiation - Hertzian dipole, antenna parameters"}
      ]
    },
    {
      "id": 8,
      "code": "EEEN 321",
      "name": "Control Systems",
      "description": "Analysis of linear control systems by differential equations and transfer function methods using Laplace transforms. Stability of closed loop systems. Routh-Hurwitz criterion, root-locus diagrams. System analysis in frequency domain. Bode and Nyquist plots. Nyquist stability criterion. Introduction to Design and Optimization. Matlab applications.",
      "keywords": "feedback control, transfer functions, stability, Routh-Hurwitz, root locus, Bode plots, Nyquist plots, PID controller, state-space, MATLAB",
      "content": [
        {"week_number": 1, "topic": "Introduction to Control Systems - Open-loop vs closed-loop control"},
        {"week_number": 2, "topic": "Mathematical Models - Differential equations, transfer functions"},
        {"week_number": 3, "topic": "Block Diagrams and Signal Flow Graphs - Reduction techniques, Mason's rule"},
        {"week_number": 4, "topic": "Time Response Analysis - First and second-order systems, step response"},
        {"week_number": 5, "topic": "Steady-State Errors - Error constants, system type"},
        {"week_number": 6, "topic": "Stability Analysis - Routh-Hurwitz criterion"},
        {"week_number": 7, "topic": "Root Locus Method I - Construction rules, breakaway points"},
        {"week_number": 8, "topic": "Root Locus Method II - Design using root locus"},
        {"week_number": 9, "topic": "Frequency Response I - Bode plots, gain and phase margins"},
        {"week_number": 10, "topic": "Frequency Response II - Nyquist plots, Nyquist stability criterion"},
        {"week_number": 11, "topic": "Controller Design I - PID controllers, tuning methods"},
        {"week_number": 12, "topic": "Controller Design II - Lead and lag compensators"},
        {"week_number": 13, "topic": "State-Space Methods - State equations, controllability, observability"},
        {"week_number": 14, "topic": "Digital Control Systems - Discrete-time systems, z-domain analysis"}
      ]
    },
    {
      "id": 9,
      "code": "EEEN 331",
      "name": "Communication Systems",
      "description": "In this course, the basic concepts of communications engineering, the modulation techniques used in communication systems, and their performance analyses are introduced. Topics include analog and digital modulation, noise analysis, and information theory.",
      "keywords": "modulation, AM, FM, digital modulation, ASK, FSK, PSK, QAM, noise, SNR, BER, channel capacity, Shannon theorem, error correction",
      "content": [
        {"week_number": 1, "topic": "Introduction to Communication Systems - Information transmission, channel capacity"},
        {"week_number": 2, "topic": "Signals and Spectra - Fourier analysis, power spectral density"},
        {"week_number": 3, "topic": "Amplitude Modulation - AM, DSB-SC, SSB modulation and demodulation"},
        {"week_number": 4, "topic": "Frequency Modulation - FM and PM, Carson's rule, bandwidth"},
        {"week_number": 5, "topic": "Sampling and Quantization - Nyquist theorem, pulse code modulation"},
        {"week_number": 6, "topic": "Baseband Digital Transmission - Line coding, ISI, eye diagrams"},
        {"week_number": 7, "topic": "Digital Modulation I - ASK, FSK, PSK modulation schemes"},
        {"week_number": 8, "topic": "Digital Modulation II - QAM, constellation diagrams"},
        {"week_number": 9, "topic": "Noise in Communication Systems - White noise, noise figure"},
        {"week_number": 10, "topic": "Performance Analysis - SNR, bit error rate, probability of error"},
        {"week_number": 11, "topic": "Information Theory - Entropy, channel capacity, Shannon's theorem"},
        {"week_number": 12, "topic": "Error Control Coding - Block codes, Hamming codes"},
        {"week_number": 13, "topic": "Multiple Access Techniques - FDMA, TDMA, CDMA"},
        {"week_number": 14, "topic": "Modern Communication Systems - Wireless, cellular, spread spectrum"}
      ]
    },
    {
      "id": 10,
      "code": "EEEN 341",
      "name": "Power Systems",
      "description": "Introduction to electric power generation, transmission, and distribution. Topics include power system components, three-phase circuits, transformers, generators, motors, and power flow analysis.",
      "keywords": "three-phase systems, transformers, synchronous generators, induction motors, transmission lines, power flow, fault analysis, protection, power system stability",
      "content": [
        {"week_number": 1, "topic": "Introduction to Power Systems - Generation, transmission, distribution"},
        {"week_number": 2, "topic": "Three-Phase Systems Review - Balanced systems, per-phase analysis"},
        {"week_number": 3, "topic": "Transformers I - Ideal transformers, voltage regulation"},
        {"week_number": 4, "topic": "Transformers II - Equivalent circuits, three-phase transformers"},
        {"week_number": 5, "topic": "Synchronous Generators I - Construction, EMF generation, armature reaction"},
        {"week_number": 6, "topic": "Synchronous Generators II - Equivalent circuit, voltage regulation, parallel operation"},
        {"week_number": 7, "topic": "Synchronous Motors - Equivalent circuit, torque, V-curves"},
        {"week_number": 8, "topic": "Induction Motors I - Rotating magnetic field, slip, equivalent circuit"},
        {"week_number": 9, "topic": "Induction Motors II - Torque-slip characteristics, starting methods"},
        {"week_number": 10, "topic": "Transmission Lines I - Line parameters, resistance, inductance, capacitance"},
        {"week_number": 11, "topic": "Transmission Lines II - Line models, ABCD parameters"},
        {"week_number": 12, "topic": "Power Flow Analysis - Bus admittance matrix, Gauss-Seidel method"},
        {"week_number": 13, "topic": "Fault Analysis - Symmetrical faults, per-unit system"},
        {"week_number": 14, "topic": "Protection and Stability - Relaying, transient stability"}
      ]
    },
    {
      "id": 11,
      "code": "EEEN 351",
      "name": "Microprocessors and Microcontrollers",
      "description": "Introduction to microprocessor architecture, assembly language programming, and microcontroller applications. Topics include CPU architecture, instruction sets, memory interfacing, and I/O programming.",
      "keywords": "microprocessor architecture, assembly language, instruction set, memory interfacing, I/O, interrupts, timers, serial communication, ADC, embedded systems",
      "content": [
        {"week_number": 1, "topic": "Microprocessor Fundamentals - Architecture, fetch-decode-execute cycle"},
        {"week_number": 2, "topic": "Number Systems and Data Representation - Binary arithmetic, ASCII, floating point"},
        {"week_number": 3, "topic": "Assembly Language Programming I - Instruction set, addressing modes"},
        {"week_number": 4, "topic": "Assembly Language Programming II - Subroutines, stack operations"},
        {"week_number": 5, "topic": "Memory Organization - RAM, ROM, memory mapping, address decoding"},
        {"week_number": 6, "topic": "Memory Interfacing - Bus timing, wait states, memory expansion"},
        {"week_number": 7, "topic": "I/O Interfacing - Parallel and serial I/O, polling, interrupts"},
        {"week_number": 8, "topic": "Interrupt Handling - Interrupt service routines, priority, vectored interrupts"},
        {"week_number": 9, "topic": "Timers and Counters - Timer programming, pulse width modulation"},
        {"week_number": 10, "topic": "Serial Communication - UART, SPI, I2C protocols"},
        {"week_number": 11, "topic": "Analog-to-Digital Conversion - ADC types, interfacing, sampling"},
        {"week_number": 12, "topic": "Microcontroller Applications I - Sensor interfacing, data acquisition"},
        {"week_number": 13, "topic": "Microcontroller Applications II - Motor control, LCD interfacing"},
        {"week_number": 14, "topic": "Embedded Systems Overview - Real-time systems, embedded C programming"}
      ]
    },
    {
      "id": 12,
      "code": "EEEN 361",
      "name": "Digital Signal Processing",
      "description": "Fundamentals of digital signal processing including discrete-time signals and systems, z-transforms, DFT/FFT, digital filter design, and DSP applications.",
      "keywords": "discrete-time signals, z-transform, DFT, FFT, FIR filters, IIR filters, digital filter design, multirate processing, adaptive filters, DSP applications",
      "content": [
        {"week_number": 1, "topic": "Introduction to DSP - Applications, sampling, quantization effects"},
        {"week_number": 2, "topic": "Discrete-Time Signals and Systems - Classification, system properties"},
        {"week_number": 3, "topic": "Linear Time-Invariant Systems - Convolution, difference equations"},
        {"week_number": 4, "topic": "Z-Transform - Properties, inverse z-transform, transfer functions"},
        {"week_number": 5, "topic": "Frequency Analysis - DTFT, frequency response"},
        {"week_number": 6, "topic": "Discrete Fourier Transform - DFT definition, properties, circular convolution"},
        {"week_number": 7, "topic": "Fast Fourier Transform - FFT algorithms, decimation-in-time, decimation-in-frequency"},
        {"week_number": 8, "topic": "FIR Filter Design I - Linear phase, window method"},
        {"week_number": 9, "topic": "FIR Filter Design II - Frequency sampling, optimal design"},
        {"week_number": 10, "topic": "IIR Filter Design I - Analog filter approximations (Butterworth, Chebyshev)"},
        {"week_number": 11, "topic": "IIR Filter Design II - Bilinear transformation, impulse invariance"},
        {"week_number": 12, "topic": "Multirate Signal Processing - Decimation, interpolation, polyphase filters"},
        {"week_number": 13, "topic": "Adaptive Filters - LMS algorithm, applications"},
        {"week_number": 14, "topic": "DSP Applications - Speech processing, audio effects, image processing"}
      ]
    },
    {
      "id": 13,
      "code": "EEEN 371",
      "name": "VLSI Design",
      "description": "Introduction to Very Large Scale Integration (VLSI) design. Topics include MOS transistor theory, CMOS logic gates, design rules, layout, and simulation using CAD tools.",
      "keywords": "VLSI, CMOS, MOS transistor, logic gates, layout, design rules, memory design, adders, multipliers, low power design, testability",
      "content": [
        {"week_number": 1, "topic": "Introduction to VLSI - Moore's law, design abstraction levels, fabrication overview"},
        {"week_number": 2, "topic": "MOS Transistor Theory - NMOS and PMOS operation, I-V characteristics"},
        {"week_number": 3, "topic": "CMOS Inverter - Static characteristics, switching characteristics, power dissipation"},
        {"week_number": 4, "topic": "Combinational Logic Design - Static CMOS gates, complex gates"},
        {"week_number": 5, "topic": "Sequential Logic Design - Latches and flip-flops, timing analysis"},
        {"week_number": 6, "topic": "Design Rules and Layout - Lambda rules, stick diagrams, layout techniques"},
        {"week_number": 7, "topic": "Interconnect and Parasitic Effects - RC delay, capacitance models"},
        {"week_number": 8, "topic": "Dynamic Logic - Precharge-evaluate logic, domino logic"},
        {"week_number": 9, "topic": "Memory Design - SRAM cell design, sense amplifiers"},
        {"week_number": 10, "topic": "Adder Architectures - Ripple carry, carry lookahead, carry select adders"},
        {"week_number": 11, "topic": "Multiplier Design - Array multipliers, Wallace tree"},
        {"week_number": 12, "topic": "Clock Distribution - Clock skew, H-tree structures"},
        {"week_number": 13, "topic": "Low Power Design - Power estimation, power reduction techniques"},
        {"week_number": 14, "topic": "Design for Testability - Scan chains, BIST, fault models"}
      ]
    },
    {
      "id": 14,
      "code": "EEEN 380",
      "name": "Renewable Energy Systems",
      "description": "Introduction to renewable energy technologies including solar, wind, hydroelectric, and other sustainable energy systems. Energy conversion, system design, and grid integration.",
      "keywords": "solar energy, photovoltaics, wind energy, hydroelectric, biomass, geothermal, energy storage, power electronics, grid integration, sustainability",
      "content": [
        {"week_number": 1, "topic": "Energy Overview - Global energy consumption, environmental impact, sustainability"},
        {"week_number": 2, "topic": "Solar Radiation - Solar geometry, irradiance, solar angles"},
        {"week_number": 3, "topic": "Photovoltaic Systems I - Solar cell physics, I-V characteristics, efficiency"},
        {"week_number": 4, "topic": "Photovoltaic Systems II - PV array design, MPPT, inverters"},
        {"week_number": 5, "topic": "Solar Thermal Systems - Collectors, concentrating systems, thermal storage"},
        {"week_number": 6, "topic": "Wind Energy I - Wind resources, wind turbine types, power curves"},
        {"week_number": 7, "topic": "Wind Energy II - Wind turbine generators, power electronics, control"},
        {"week_number": 8, "topic": "Hydroelectric Power - Types of hydro plants, turbines, power calculation"},
        {"week_number": 9, "topic": "Biomass and Biofuels - Biomass conversion, biogas, biodiesel"},
        {"week_number": 10, "topic": "Geothermal Energy - Heat pumps, geothermal power plants"},
        {"week_number": 11, "topic": "Energy Storage - Batteries, flywheels, pumped hydro, compressed air"},
        {"week_number": 12, "topic": "Power Electronics for Renewable Energy - DC-DC converters, inverters, grid codes"},
        {"week_number": 13, "topic": "Grid Integration - Distributed generation, microgrid, smart grid"},
        {"week_number": 14, "topic": "Economics and Policy - Cost analysis, subsidies, carbon credits"}
      ]
    },
    {
      "id": 15,
      "code": "EEEN 401",
      "name": "Advanced Electronics",
      "description": "Advanced topics in analog and digital electronics including integrated circuit design, high-frequency circuits, noise analysis, and modern semiconductor devices.",
      "keywords": "high-frequency amplifiers, noise analysis, oscillators, PLL, mixers, power amplifiers, RF circuits, data converters, switched-capacitor circuits, S-parameters",
      "content": [
        {"week_number": 1, "topic": "Review of Semiconductor Devices - Diodes, BJT, MOSFET characteristics"},
        {"week_number": 2, "topic": "Advanced Amplifier Topologies - Cascode amplifiers, differential amplifiers"},
        {"week_number": 3, "topic": "High-Frequency Amplifiers - High-frequency transistor models, neutralization"},
        {"week_number": 4, "topic": "Noise in Electronic Circuits - Noise sources, noise figure, low-noise design"},
        {"week_number": 5, "topic": "Oscillator Design - Phase noise, crystal oscillators, VCOs"},
        {"week_number": 6, "topic": "Phase-Locked Loops - PLL architecture, loop filters, applications"},
        {"week_number": 7, "topic": "Mixers and Modulators - Frequency conversion, Gilbert cell"},
        {"week_number": 8, "topic": "Power Amplifiers - Classes of operation, efficiency, linearity"},
        {"week_number": 9, "topic": "Analog Integrated Circuit Design - Current mirrors, bandgap references"},
        {"week_number": 10, "topic": "Advanced Data Converters - Pipeline ADC, delta-sigma converters"},
        {"week_number": 11, "topic": "Switched-Capacitor Circuits - Sample-and-hold, SC filters"},
        {"week_number": 12, "topic": "RF Circuit Design - Matching networks, S-parameters"},
        {"week_number": 13, "topic": "Advanced Semiconductor Devices - HBT, HEMT, SiGe devices"},
        {"week_number": 14, "topic": "Circuit Simulation and Layout - SPICE simulation, layout considerations"}
      ]
    },
    {
      "id": 16,
      "code": "EEEN 411",
      "name": "Wireless Communications",
      "description": "Principles of wireless communication systems including propagation, modulation, multiple access, cellular systems, and modern wireless standards.",
      "keywords": "wireless propagation, fading, MIMO, OFDM, cellular systems, GSM, LTE, 5G, WiFi, Bluetooth, satellite communications, link budget",
      "content": [
        {"week_number": 1, "topic": "Introduction to Wireless Communications - History, frequency bands, applications"},
        {"week_number": 2, "topic": "Wireless Channel I - Path loss, shadowing, multipath fading"},
        {"week_number": 3, "topic": "Wireless Channel II - Fading statistics, Rayleigh and Rician fading"},
        {"week_number": 4, "topic": "Digital Modulation for Wireless - BPSK, QPSK, QAM, OFDM"},
        {"week_number": 5, "topic": "Diversity Techniques - Time, frequency, and space diversity, MIMO"},
        {"week_number": 6, "topic": "Multiple Access Techniques - FDMA, TDMA, CDMA, OFDMA"},
        {"week_number": 7, "topic": "Spread Spectrum - Direct sequence, frequency hopping, PN sequences"},
        {"week_number": 8, "topic": "Cellular Systems I - Cellular concept, frequency reuse, handoff"},
        {"week_number": 9, "topic": "Cellular Systems II - GSM, CDMA, LTE architecture"},
        {"week_number": 10, "topic": "5G and Beyond - Massive MIMO, mmWave, network slicing"},
        {"week_number": 11, "topic": "Wireless LANs - IEEE 802.11 standards, WiFi"},
        {"week_number": 12, "topic": "Bluetooth and IoT - Bluetooth architecture, Zigbee, LoRa"},
        {"week_number": 13, "topic": "Satellite Communications - Orbits, link budget, satellite systems"},
        {"week_number": 14, "topic": "Wireless System Design - Link budget, capacity planning, QoS"}
      ]
    },
    {
      "id": 17,
      "code": "EEEN 421",
      "name": "Robotics and Automation",
      "description": "Introduction to robotics including kinematics, dynamics, control, sensors, and actuators. Applications to industrial automation and autonomous systems.",
      "keywords": "kinematics, dynamics, forward kinematics, inverse kinematics, Jacobian, trajectory planning, robot control, sensors, actuators, mobile robotics, SLAM",
      "content": [
        {"week_number": 1, "topic": "Introduction to Robotics - History, robot types, applications"},
        {"week_number": 2, "topic": "Spatial Descriptions - Position, orientation, homogeneous transformations"},
        {"week_number": 3, "topic": "Forward Kinematics - DH parameters, link transformations"},
        {"week_number": 4, "topic": "Inverse Kinematics - Analytical and numerical solutions, workspace"},
        {"week_number": 5, "topic": "Velocity Kinematics - Jacobian matrix, singularities"},
        {"week_number": 6, "topic": "Dynamics I - Lagrangian formulation, equations of motion"},
        {"week_number": 7, "topic": "Dynamics II - Newton-Euler formulation, recursive algorithms"},
        {"week_number": 8, "topic": "Trajectory Planning - Point-to-point, via points, path planning"},
        {"week_number": 9, "topic": "Robot Control I - PID control, computed torque control"},
        {"week_number": 10, "topic": "Robot Control II - Force control, impedance control"},
        {"week_number": 11, "topic": "Sensors for Robotics - Encoders, IMU, vision sensors, force sensors"},
        {"week_number": 12, "topic": "Actuators - DC motors, stepper motors, servo systems, pneumatics"},
        {"week_number": 13, "topic": "Mobile Robotics - Locomotion, localization, SLAM basics"},
        {"week_number": 14, "topic": "Industrial Automation - Robot programming, safety, future trends"}
      ]
    },
    {
      "id": 18,
      "code": "EEEN 431",
      "name": "Optical Communications",
      "description": "Fundamentals of optical fiber communications including light propagation, optical sources and detectors, fiber characteristics, and optical communication systems.",
      "keywords": "optical fiber, light propagation, attenuation, dispersion, laser diode, LED, photodiode, WDM, DWDM, optical amplifiers, coherent detection",
      "content": [
        {"week_number": 1, "topic": "Introduction to Optical Communications - History, advantages, system components"},
        {"week_number": 2, "topic": "Optical Fiber Basics - Structure, total internal reflection, modes"},
        {"week_number": 3, "topic": "Fiber Types and Characteristics - Single-mode, multimode, graded-index fibers"},
        {"week_number": 4, "topic": "Signal Attenuation - Loss mechanisms, attenuation coefficient, fiber windows"},
        {"week_number": 5, "topic": "Signal Dispersion - Modal dispersion, chromatic dispersion, polarization mode dispersion"},
        {"week_number": 6, "topic": "Optical Sources I - LED and laser diode principles"},
        {"week_number": 7, "topic": "Optical Sources II - Direct and external modulation, laser characteristics"},
        {"week_number": 8, "topic": "Optical Detectors - Photodiode principles, PIN, APD, detector performance"},
        {"week_number": 9, "topic": "Optical Receivers - Receiver architecture, noise, sensitivity"},
        {"week_number": 10, "topic": "Digital Optical Communication Systems - Bit rate, link budget, system design"},
        {"week_number": 11, "topic": "Wavelength Division Multiplexing - WDM principles, DWDM, optical amplifiers"},
        {"week_number": 12, "topic": "Optical Amplifiers - EDFA, SOA, Raman amplifiers"},
        {"week_number": 13, "topic": "Advanced Modulation Formats - Coherent detection, QPSK, QAM"},
        {"week_number": 14, "topic": "Optical Networks - SONET/SDH, optical switches, future technologies"}
      ]
    },
    {
      "id": 19,
      "code": "EEEN 441",
      "name": "Smart Grid Technologies",
      "description": "Modern electric grid technologies including smart meters, demand response, distributed generation, energy storage, and grid communication systems.",
      "keywords": "smart grid, smart meters, AMI, demand response, distributed generation, energy storage, microgrids, power electronics, cybersecurity, electric vehicles, V2G",
      "content": [
        {"week_number": 1, "topic": "Introduction to Smart Grid - Concept, drivers, benefits, challenges"},
        {"week_number": 2, "topic": "Traditional Power Grid - Generation, transmission, distribution review"},
        {"week_number": 3, "topic": "Smart Grid Architecture - Infrastructure layers, components, standards"},
        {"week_number": 4, "topic": "Advanced Metering Infrastructure - Smart meters, data management, privacy"},
        {"week_number": 5, "topic": "Demand Response - Load management, pricing schemes, consumer participation"},
        {"week_number": 6, "topic": "Distributed Energy Resources - DER types, grid integration, impact"},
        {"week_number": 7, "topic": "Energy Storage Systems - Battery technologies, supercapacitors, grid-scale storage"},
        {"week_number": 8, "topic": "Microgrids - Architecture, control, islanding, resilience"},
        {"week_number": 9, "topic": "Power Electronics for Smart Grid - Inverters, converters, FACTS devices"},
        {"week_number": 10, "topic": "Communication Technologies - PLC, wireless, fiber optics, protocols"},
        {"week_number": 11, "topic": "Smart Grid Cybersecurity - Threats, encryption, authentication, standards"},
        {"week_number": 12, "topic": "Electric Vehicles and V2G - EV charging, vehicle-to-grid integration"},
        {"week_number": 13, "topic": "Grid Analytics - Big data, machine learning, predictive maintenance"},
        {"week_number": 14, "topic": "Future Grid Technologies - Blockchain, AI, quantum computing applications"}
      ]
    },
    {
      "id": 20,
      "code": "EEEN 451",
      "name": "Embedded Systems Design",
      "description": "Advanced embedded systems including real-time operating systems, hardware-software co-design, embedded networking, and system-on-chip design.",
      "keywords": "embedded systems, ARM, RTOS, real-time scheduling, hardware-software co-design, CAN bus, SoC, FPGA, IoT, edge computing, embedded security",
      "content": [
        {"week_number": 1, "topic": "Embedded Systems Overview - Characteristics, applications, design challenges"},
        {"week_number": 2, "topic": "Embedded Processors - ARM, AVR, PIC architectures, selection criteria"},
        {"week_number": 3, "topic": "Memory Technologies - Flash, SRAM, DRAM, memory management"},
        {"week_number": 4, "topic": "Embedded C Programming - Optimization, volatile, bit manipulation"},
        {"week_number": 5, "topic": "Real-Time Systems - Real-time constraints, scheduling, priority"},
        {"week_number": 6, "topic": "Real-Time Operating Systems I - RTOS concepts, tasks, kernel"},
        {"week_number": 7, "topic": "RTOS II - Synchronization, semaphores, mutexes, message queues"},
        {"week_number": 8, "topic": "Hardware-Software Co-Design - Partitioning, co-simulation, optimization"},
        {"week_number": 9, "topic": "Embedded Networking - CAN bus, Ethernet, wireless protocols"},
        {"week_number": 10, "topic": "Power Management - Low-power modes, dynamic voltage scaling, energy harvesting"},
        {"week_number": 11, "topic": "System-on-Chip Design - SoC architecture, IP cores, buses"},
        {"week_number": 12, "topic": "FPGA-Based Systems - FPGA architecture, HDL design, hardware acceleration"},
        {"week_number": 13, "topic": "Embedded Security - Secure boot, encryption, trusted execution"},
        {"week_number": 14, "topic": "IoT and Edge Computing - IoT protocols, edge processing, cloud integration"}
      ]
    }
  ]
}